{
	"@metadata": {
		"authors": [
			"Amire80",
			"Liuxinyu970226",
			"Sam Wilson <sam@samwilson.id.au>",
			"Umherirrender"
		]
	},
	"genealogy": "{{name}}",
	"genealogy-desc": "{{desc|name=Genealogy|url=https://www.mediawiki.org/wiki/Extension:Genealogy}}",
	"genealogy-born": "The parenthetic abbreviation showing the year of birth.",
	"genealogy-died": "The parenthetic abbreviation showing the year of death.",
	"genealogy-born-and-died": "{{optional}}\nThe parenthetic abbreviation showing both the year of birth and year of death.",
	"genealogy-ancestor": "A singular noun referring to any parent, grandparent, etc. of a given person.\n{{Identical|Ancestor}}",
	"genealogy-ancestors": "A plural noun referring to all parents, grandparents, etc. of a given person.\n{{Identical|Ancestor}}",
	"genealogy-descendant": "A singular noun referring to any child, grandchild, etc. of a given person.\n{{Identical|Descendant}}",
	"genealogy-descendants": "A plural noun referring to all children, grandchildren, etc. of a given person.\n{{Identical|Descendant}}",
	"genealogy-person-preload": "A name of the MediaWiki page that contains the text that is preloaded when a new Person page is created.",
	"genealogy-person-list-item": "The template that will be used (if it exists) to format each item in any list of people.",
	"genealogy-parser-function-not-found": "The error message shown when the parser function is passed something it doesn't recognise.",
	"genealogy-existing-partners": "The message that is shown above the page-editing form, alerting the user to the fact that the person they're editing has already got a defined partner from another page.",
	"genealogy-invalid-parent-title": "The error message that is shown when a user-supplied parent name is not a valid page title.",
	"genealogy-invalid-partner-title": "The error message that is shown when a user-supplied partner name is not a valid page title.",
	"genealogy-invalid-tree-format": "An error message displayed when an invalid tree format has been specified.\n* $1 is the user-specified format."
}
